{
  "data":{
    "repository":{
      "issues":{
        "nodes":[
          {
            "number":330,
            "title":"Organization search is case-sensitive and not consistent with GitHub",
            "bodyText":"Searching for organization:ThoughtWorksInc yields 0 results\nSearching for organization:thoughtworksinc yields 19 results\nHowever, the GitHub organization utilizes Pascal Case: https://github.com/ThoughtWorksInc\nThe simplest solution is probably to make organization search case-insensitive.",
            "url":"https://github.com/scalacenter/scaladex/issues/330"
          },
          {
            "number":353,
            "title":"Artifact naming by Dependents and Dependencies allows for ambiguity",
            "bodyText":"The depends-on: query (such as accessed  via \"Artifact Dependencies\") takes a parameter of form \"$organization/$artifactName\".  The dependents and dependency boxes on artifact pages also display this form.\nThis is not consistent with the hierarchy a user sees elsewhere in Scaladex which has the general form \"$organization/$project/$artifactName/$version\", as the $project level is omitted.  The user would need to know the $project to get to Artifact page.\nTrying to specify an artifact without knowing the project creates ambiguity.  For example, if I query for depends-on:ubirch/core do I mean ubirch/ubirch-avatar-service/core or ubirch/ubirch-avatar-service/core?\nNoticed while observing #314",
            "url":"https://github.com/scalacenter/scaladex/issues/353"
          },
          {
            "number":356,
            "title":"Responsive layout for page heading does not work well when logged in",
            "bodyText":"When not logged in, the site is maybe a little eager to get you to log-in but otherwise fine:\n\nHowever, when you do log in things don't layout quite right in responsive mode:",
            "url":"https://github.com/scalacenter/scaladex/issues/356"
          },
          {
            "number":396,
            "title":"Pagination performs too many requests",
            "bodyText":"At this place we compute the number of pages to load. However, X-RangeLimit-Total gives the number of results, not the number of pages. Hence, we perform way too many calls.\nEventually we want to use BintrayClient.fetchPaginatedResource instead, which makes just the required number of calls, not more :)",
            "url":"https://github.com/scalacenter/scaladex/issues/396"
          }
        ]
      }
    }
  }
}